INSERT INTO Users (prefix, firstname, lastname, username, password, email, phone, gender, birthday, profile_image)
VALUES
('นาย', 'สมชาย', 'ไทยแท้', 'somchai123', '$2y$10$w2AWwBgsSKnxp.F13YONmuWsUgWWXCCWA55Y2sgJGFZXQ7TBLCslK', 'somchai@example.com', '0912345678', 'Male', '1990-01-01', NULL),
('นางสาว', 'จุฑามาศ', 'ดีเด่น', 'juthamas123', '$2y$10$w2AWwBgsSKnxp.F13YONmuWsUgWWXCCWA55Y2sgJGFZXQ7TBLCslK', 'juthamas@example.com', '0987654321', 'Female', '1995-02-15', NULL),
('นาย', 'วัชรพล', 'วิถีไทย', 'watcharapol123', '$2y$10$w2AWwBgsSKnxp.F13YONmuWsUgWWXCCWA55Y2sgJGFZXQ7TBLCslK', 'watcharapol@example.com', '0922334455', 'Male', '1988-10-25', NULL),
('นาง', 'วิภาดา', 'สมบัติ', 'wiphatda123', '$2y$10$w2AWwBgsSKnxp.F13YONmuWsUgWWXCCWA55Y2sgJGFZXQ7TBLCslK', 'wiphatda@example.com', '0933445566', 'Female', '1992-07-09', NULL),
('นาย', 'ธนากร', 'กรุงไทย', 'thanakorn123', '$2y$10$w2AWwBgsSKnxp.F13YONmuWsUgWWXCCWA55Y2sgJGFZXQ7TBLCslK', 'thanakorn@example.com', '0944556677', 'Male', '1993-12-30', NULL);

INSERT INTO Events (title, description, event_types, start_date, end_date, time, location, organizer_id, qr_code_att, text_code_att)
VALUES
('การแข่งขันฟุตบอลการกุศล', 'การแข่งขันฟุตบอลระหว่างทีมต่างๆ เพื่อการกุศล รายได้ทั้งหมดจะนำไปบริจาคให้แก่โรงพยาบาล', 'กีฬา', '2025-03-01 09:00:00', '2025-03-01 17:00:00', '09:00:00', 'สนามกีฬาแห่งชาติ', 1, NULL, 'checkin'),
('งานสัมมนาเทคโนโลยีการศึกษา', 'การสัมมนาเกี่ยวกับเทคโนโลยีในการศึกษา และการใช้เครื่องมือดิจิทัลในการเรียนการสอน', 'การศึกษา', '2025-03-10 08:30:00', '2025-03-10 16:00:00', '08:30:00', 'โรงแรมมณเฑียร', 2, NULL, 'checkin'),
('กิจกรรมจิตอาสาทำความสะอาดชุมชน', 'การทำความสะอาดในพื้นที่ชุมชน และการปลูกต้นไม้เพื่อฟื้นฟูสิ่งแวดล้อม', 'จิตอาสา', '2025-03-15 07:00:00', '2025-03-15 12:00:00', '07:00:00', 'หมู่บ้านพัฒนานิเวศ', 3, NULL,'checkin'),
('งานเทศกาลอาหารไทย', 'งานแสดงและจำหน่ายอาหารไทยทั้งจากร้านดังและร้านอาหารท้องถิ่น พร้อมกิจกรรมต่างๆ เช่น การประกวดทำอาหาร', 'วัฒนธรรม', '2025-03-20 10:00:00', '2025-03-20 22:00:00', '10:00:00', 'สวนลุมพินี', 4, NULL,'checkin'),
('การประชุมสัมมนาด้านสุขภาพ', 'การประชุมเพื่อเผยแพร่ข้อมูลเกี่ยวกับการดูแลสุขภาพในยุคปัจจุบัน รวมถึงวิธีการป้องกันโรคต่างๆ', 'สุขภาพ', '2025-03-25 08:00:00', '2025-03-25 17:00:00', '08:00:00', 'หอประชุมวิจัยมหาวิทยาลัย', 5, NULL, 'checkin');
INSERT INTO Registration (user_id, event_id, status, requested_at)
VALUES
(1, 1, 'Pending', NOW()),
(2, 2, 'Approved', NOW()),
(3, 3, 'Rejected', NOW()),
(4, 4, 'Pending', NOW()),
(5, 5, 'Approved', NOW());
INSERT INTO Events (title, description, event_types, participant_amount, start_date, end_date, time, location, organizer_id, qr_code_att, text_code_att)
VALUES
('การแข่งขันฟุตบอลการกุศล', 'การแข่งขันฟุตบอลระหว่างทีมต่างๆ เพื่อการกุศล รายได้ทั้งหมดจะนำไปบริจาคให้แก่โรงพยาบาล', 'กีฬา', 100, '2025-03-01 09:00:00', '2025-03-01 17:00:00', '09:00:00', 'สนามกีฬาแห่งชาติ', 1, NULL, 'checkin'),
('งานสัมมนาเทคโนโลยีการศึกษา', 'การสัมมนาเกี่ยวกับเทคโนโลยีในการศึกษา และการใช้เครื่องมือดิจิทัลในการเรียนการสอน', 'การศึกษา', 200, '2025-03-10 08:30:00', '2025-03-10 16:00:00', '08:30:00', 'โรงแรมมณเฑียร', 2, NULL, 'checkin'),
('กิจกรรมจิตอาสาทำความสะอาดชุมชน', 'การทำความสะอาดในพื้นที่ชุมชน และการปลูกต้นไม้เพื่อฟื้นฟูสิ่งแวดล้อม', 'จิตอาสา', 50, '2025-03-15 07:00:00', '2025-03-15 12:00:00', '07:00:00', 'หมู่บ้านพัฒนานิเวศ', 3, NULL, 'checkin'),
('งานเทศกาลอาหารไทย', 'งานแสดงและจำหน่ายอาหารไทยทั้งจากร้านดังและร้านอาหารท้องถิ่น พร้อมกิจกรรมต่างๆ เช่น การประกวดทำอาหาร', 'วัฒนธรรม', 300, '2025-03-20 10:00:00', '2025-03-20 22:00:00', '10:00:00', 'สวนลุมพินี', 4, NULL, 'checkin'),
('การประชุมสัมมนาด้านสุขภาพ', 'การประชุมเพื่อเผยแพร่ข้อมูลเกี่ยวกับการดูแลสุขภาพในยุคปัจจุบัน รวมถึงวิธีการป้องกันโรคต่างๆ', 'สุขภาพ', 150, '2025-03-25 08:00:00', '2025-03-25 17:00:00', '08:00:00', 'หอประชุมวิจัยมหาวิทยาลัย', 5, NULL, 'checkin');
